renesas/iot-reference-rx/Common/littlefs_common/rm_littlefs_df/targets/rx65n/rm_littlefs_df_rx65n.h
/*
* Copyright (c) 2023-2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/

/**********************************************************************************************************************
* File Name    : rm_littlefs_df_rx65n.h
* Description  : The content of this header file is duplicated from r_flash_rx65n.h for LittleFS configuration
*                purpose. It should not be modified or included by the user in their application.
*********************************************************************************************************************/

#ifndef LITTLEFS_COMMON_RM_LITTLEFS_DF_TARGETS_RX65N_RM_LITTLEFS_DF_RX65N_H_
#define LITTLEFS_COMMON_RM_LITTLEFS_DF_TARGETS_RX65N_RM_LITTLEFS_DF_RX65N_H_

/* Below is copied from r_flash_rx65n.h, with added "_MACRO" at the end of enum to avoid duplication */
#define FLASH_DF_BLOCK_0_MACRO    (0x00100000)    /*   64B: 0x00100000 - 0x0010003F */
#define FLASH_DF_BLOCK_1_MACRO    (0x00100040)    /*   64B: 0x00100040 - 0x0010007F */
#define FLASH_DF_BLOCK_2_MACRO    (0x00100080)    /*   64B: 0x00100080 - 0x001000BF */
#define FLASH_DF_BLOCK_3_MACRO    (0x001000C0)    /*   64B: 0x001000C0 - 0x001000FF */
#define FLASH_DF_BLOCK_4_MACRO    (0x00100100)    /*   64B: 0x00100100 - 0x0010013F */
#define FLASH_DF_BLOCK_5_MACRO    (0x00100140)    /*   64B: 0x00100140 - 0x0010017F */
#define FLASH_DF_BLOCK_6_MACRO    (0x00100180)    /*   64B: 0x00100180 - 0x001001BF */
#define FLASH_DF_BLOCK_7_MACRO    (0x001001C0)    /*   64B: 0x001001C0 - 0x001001FF */
#define FLASH_DF_BLOCK_8_MACRO    (0x00100200)    /*   64B: 0x00100200 - 0x0010023F */
#define FLASH_DF_BLOCK_9_MACRO    (0x00100240)    /*   64B: 0x00100240 - 0x0010027F */
#define FLASH_DF_BLOCK_10_MACRO   (0x00100280)    /*   64B: 0x00100280 - 0x001002BF */
#define FLASH_DF_BLOCK_11_MACRO   (0x001002C0)    /*   64B: 0x001002C0 - 0x001002FF */
#define FLASH_DF_BLOCK_12_MACRO   (0x00100300)    /*   64B: 0x00100300 - 0x0010033F */
#define FLASH_DF_BLOCK_13_MACRO   (0x00100340)    /*   64B: 0x00100340 - 0x0010037F */
#define FLASH_DF_BLOCK_14_MACRO   (0x00100380)    /*   64B: 0x00100380 - 0x001003BF */
#define FLASH_DF_BLOCK_15_MACRO   (0x001003C0)    /*   64B: 0x001003C0 - 0x001003FF */
#define FLASH_DF_BLOCK_16_MACRO   (0x00100400)    /*   64B: 0x00100400 - 0x0010043F */
#define FLASH_DF_BLOCK_17_MACRO   (0x00100440)    /*   64B: 0x00100440 - 0x0010047F */
#define FLASH_DF_BLOCK_18_MACRO   (0x00100480)    /*   64B: 0x00100480 - 0x001004BF */
#define FLASH_DF_BLOCK_19_MACRO   (0x001004C0)    /*   64B: 0x001004C0 - 0x001004FF */
#define FLASH_DF_BLOCK_20_MACRO   (0x00100500)    /*   64B: 0x00100500 - 0x0010053F */
#define FLASH_DF_BLOCK_21_MACRO   (0x00100540)    /*   64B: 0x00100540 - 0x0010057F */
#define FLASH_DF_BLOCK_22_MACRO   (0x00100580)    /*   64B: 0x00100580 - 0x001005BF */
#define FLASH_DF_BLOCK_23_MACRO   (0x001005C0)    /*   64B: 0x001005C0 - 0x001005FF */
#define FLASH_DF_BLOCK_24_MACRO   (0x00100600)    /*   64B: 0x00100600 - 0x0010063F */
#define FLASH_DF_BLOCK_25_MACRO   (0x00100640)    /*   64B: 0x00100640 - 0x0010067F */
#define FLASH_DF_BLOCK_26_MACRO   (0x00100680)    /*   64B: 0x00100680 - 0x001006BF */
#define FLASH_DF_BLOCK_27_MACRO   (0x001006C0)    /*   64B: 0x001006C0 - 0x001006FF */
#define FLASH_DF_BLOCK_28_MACRO   (0x00100700)    /*   64B: 0x00100700 - 0x0010073F */
#define FLASH_DF_BLOCK_29_MACRO   (0x00100740)    /*   64B: 0x00100740 - 0x0010077F */
#define FLASH_DF_BLOCK_30_MACRO   (0x00100780)    /*   64B: 0x00100780 - 0x001007BF */
#define FLASH_DF_BLOCK_31_MACRO   (0x001007C0)    /*   64B: 0x001007C0 - 0x001007FF */
#define FLASH_DF_BLOCK_32_MACRO   (0x00100800)    /*   64B: 0x00100800 - 0x0010083F */
#define FLASH_DF_BLOCK_33_MACRO   (0x00100840)    /*   64B: 0x00100840 - 0x0010087F */
#define FLASH_DF_BLOCK_34_MACRO   (0x00100880)    /*   64B: 0x00100880 - 0x001008BF */
#define FLASH_DF_BLOCK_35_MACRO   (0x001008C0)    /*   64B: 0x001008C0 - 0x001008FF */
#define FLASH_DF_BLOCK_36_MACRO   (0x00100900)    /*   64B: 0x00100900 - 0x0010093F */
#define FLASH_DF_BLOCK_37_MACRO   (0x00100940)    /*   64B: 0x00100940 - 0x0010097F */
#define FLASH_DF_BLOCK_38_MACRO   (0x00100980)    /*   64B: 0x00100980 - 0x001009BF */
#define FLASH_DF_BLOCK_39_MACRO   (0x001009C0)    /*   64B: 0x001009C0 - 0x001009FF */
#define FLASH_DF_BLOCK_40_MACRO   (0x00100A00)    /*   64B: 0x00100A00 - 0x00100A3F */
#define FLASH_DF_BLOCK_41_MACRO   (0x00100A40)    /*   64B: 0x00100A40 - 0x00100A7F */
#define FLASH_DF_BLOCK_42_MACRO   (0x00100A80)    /*   64B: 0x00100A80 - 0x00100ABF */
#define FLASH_DF_BLOCK_43_MACRO   (0x00100AC0)    /*   64B: 0x00100AC0 - 0x00100AFF */
#define FLASH_DF_BLOCK_44_MACRO   (0x00100B00)    /*   64B: 0x00100B00 - 0x00100B3F */
#define FLASH_DF_BLOCK_45_MACRO   (0x00100B40)    /*   64B: 0x00100B40 - 0x00100B7F */
#define FLASH_DF_BLOCK_46_MACRO   (0x00100B80)    /*   64B: 0x00100B80 - 0x00100BBF */
#define FLASH_DF_BLOCK_47_MACRO   (0x00100BC0)    /*   64B: 0x00100BC0 - 0x00100BFF */
#define FLASH_DF_BLOCK_48_MACRO   (0x00100C00)    /*   64B: 0x00100C00 - 0x00100C3F */
#define FLASH_DF_BLOCK_49_MACRO   (0x00100C40)    /*   64B: 0x00100C40 - 0x00100C7F */
#define FLASH_DF_BLOCK_50_MACRO   (0x00100C80)    /*   64B: 0x00100C80 - 0x00100CBF */
#define FLASH_DF_BLOCK_51_MACRO   (0x00100CC0)    /*   64B: 0x00100CC0 - 0x00100CFF */
#define FLASH_DF_BLOCK_52_MACRO   (0x00100D00)    /*   64B: 0x00100D00 - 0x00100D3F */
#define FLASH_DF_BLOCK_53_MACRO   (0x00100D40)    /*   64B: 0x00100D40 - 0x00100D7F */
#define FLASH_DF_BLOCK_54_MACRO   (0x00100D80)    /*   64B: 0x00100D80 - 0x00100DBF */
#define FLASH_DF_BLOCK_55_MACRO   (0x00100DC0)    /*   64B: 0x00100DC0 - 0x00100DFF */
#define FLASH_DF_BLOCK_56_MACRO   (0x00100E00)    /*   64B: 0x00100E00 - 0x00100E3F */
#define FLASH_DF_BLOCK_57_MACRO   (0x00100E40)    /*   64B: 0x00100E40 - 0x00100E7F */
#define FLASH_DF_BLOCK_58_MACRO   (0x00100E80)    /*   64B: 0x00100E80 - 0x00100EBF */
#define FLASH_DF_BLOCK_59_MACRO   (0x00100EC0)    /*   64B: 0x00100EC0 - 0x00100EFF */
#define FLASH_DF_BLOCK_60_MACRO   (0x00100F00)    /*   64B: 0x00100F00 - 0x00100F3F */
#define FLASH_DF_BLOCK_61_MACRO   (0x00100F40)    /*   64B: 0x00100F40 - 0x00100F7F */
#define FLASH_DF_BLOCK_62_MACRO   (0x00100F80)    /*   64B: 0x00100F80 - 0x00100FBF */
#define FLASH_DF_BLOCK_63_MACRO   (0x00100FC0)    /*   64B: 0x00100FC0 - 0x00100FFF */
#define FLASH_DF_BLOCK_64_MACRO   (0x00101000)    /*   64B: 0x00101000 - 0x0010103F */
#define FLASH_DF_BLOCK_65_MACRO   (0x00101040)    /*   64B: 0x00101040 - 0x0010107F */
#define FLASH_DF_BLOCK_66_MACRO   (0x00101080)    /*   64B: 0x00101080 - 0x001010BF */
#define FLASH_DF_BLOCK_67_MACRO   (0x001010C0)    /*   64B: 0x001010C0 - 0x001010FF */
#define FLASH_DF_BLOCK_68_MACRO   (0x00101100)    /*   64B: 0x00101100 - 0x0010113F */
#define FLASH_DF_BLOCK_69_MACRO   (0x00101140)    /*   64B: 0x00101140 - 0x0010117F */
#define FLASH_DF_BLOCK_70_MACRO   (0x00101180)    /*   64B: 0x00101180 - 0x001011BF */
#define FLASH_DF_BLOCK_71_MACRO   (0x001011C0)    /*   64B: 0x001011C0 - 0x001011FF */
#define FLASH_DF_BLOCK_72_MACRO   (0x00101200)    /*   64B: 0x00101200 - 0x0010123F */
#define FLASH_DF_BLOCK_73_MACRO   (0x00101240)    /*   64B: 0x00101240 - 0x0010127F */
#define FLASH_DF_BLOCK_74_MACRO   (0x00101280)    /*   64B: 0x00101280 - 0x001012BF */
#define FLASH_DF_BLOCK_75_MACRO   (0x001012C0)    /*   64B: 0x001012C0 - 0x001012FF */
#define FLASH_DF_BLOCK_76_MACRO   (0x00101300)    /*   64B: 0x00101300 - 0x0010133F */
#define FLASH_DF_BLOCK_77_MACRO   (0x00101340)    /*   64B: 0x00101340 - 0x0010137F */
#define FLASH_DF_BLOCK_78_MACRO   (0x00101380)    /*   64B: 0x00101380 - 0x001013BF */
#define FLASH_DF_BLOCK_79_MACRO   (0x001013C0)    /*   64B: 0x001013C0 - 0x001013FF */
#define FLASH_DF_BLOCK_80_MACRO   (0x00101400)    /*   64B: 0x00101400 - 0x0010143F */
#define FLASH_DF_BLOCK_81_MACRO   (0x00101440)    /*   64B: 0x00101440 - 0x0010147F */
#define FLASH_DF_BLOCK_82_MACRO   (0x00101480)    /*   64B: 0x00101480 - 0x001014BF */
#define FLASH_DF_BLOCK_83_MACRO   (0x001014C0)    /*   64B: 0x001014C0 - 0x001014FF */
#define FLASH_DF_BLOCK_84_MACRO   (0x00101500)    /*   64B: 0x00101500 - 0x0010153F */
#define FLASH_DF_BLOCK_85_MACRO   (0x00101540)    /*   64B: 0x00101540 - 0x0010157F */
#define FLASH_DF_BLOCK_86_MACRO   (0x00101580)    /*   64B: 0x00101580 - 0x001015BF */
#define FLASH_DF_BLOCK_87_MACRO   (0x001015C0)    /*   64B: 0x001015C0 - 0x001015FF */
#define FLASH_DF_BLOCK_88_MACRO   (0x00101600)    /*   64B: 0x00101600 - 0x0010163F */
#define FLASH_DF_BLOCK_89_MACRO   (0x00101640)    /*   64B: 0x00101640 - 0x0010167F */
#define FLASH_DF_BLOCK_90_MACRO   (0x00101680)    /*   64B: 0x00101680 - 0x001016BF */
#define FLASH_DF_BLOCK_91_MACRO   (0x001016C0)    /*   64B: 0x001016C0 - 0x001016FF */
#define FLASH_DF_BLOCK_92_MACRO   (0x00101700)    /*   64B: 0x00101700 - 0x0010173F */
#define FLASH_DF_BLOCK_93_MACRO   (0x00101740)    /*   64B: 0x00101740 - 0x0010177F */
#define FLASH_DF_BLOCK_94_MACRO   (0x00101780)    /*   64B: 0x00101780 - 0x001017BF */
#define FLASH_DF_BLOCK_95_MACRO   (0x001017C0)    /*   64B: 0x001017C0 - 0x001017FF */
#define FLASH_DF_BLOCK_96_MACRO   (0x00101800)    /*   64B: 0x00101800 - 0x0010183F */
#define FLASH_DF_BLOCK_97_MACRO   (0x00101840)    /*   64B: 0x00101840 - 0x0010187F */
#define FLASH_DF_BLOCK_98_MACRO   (0x00101880)    /*   64B: 0x00101880 - 0x001018BF */
#define FLASH_DF_BLOCK_99_MACRO   (0x001018C0)    /*   64B: 0x001018C0 - 0x001018FF */
#define FLASH_DF_BLOCK_100_MACRO  (0x00101900)    /*   64B: 0x00101900 - 0x0010193F */
#define FLASH_DF_BLOCK_101_MACRO  (0x00101940)    /*   64B: 0x00101940 - 0x0010197F */
#define FLASH_DF_BLOCK_102_MACRO  (0x00101980)    /*   64B: 0x00101980 - 0x001019BF */
#define FLASH_DF_BLOCK_103_MACRO  (0x001019C0)    /*   64B: 0x001019C0 - 0x001019FF */
#define FLASH_DF_BLOCK_104_MACRO  (0x00101A00)    /*   64B: 0x00101A00 - 0x00101A3F */
#define FLASH_DF_BLOCK_105_MACRO  (0x00101A40)    /*   64B: 0x00101A40 - 0x00101A7F */
#define FLASH_DF_BLOCK_106_MACRO  (0x00101A80)    /*   64B: 0x00101A80 - 0x00101ABF */
#define FLASH_DF_BLOCK_107_MACRO  (0x00101AC0)    /*   64B: 0x00101AC0 - 0x00101AFF */
#define FLASH_DF_BLOCK_108_MACRO  (0x00101B00)    /*   64B: 0x00101B00 - 0x00101B3F */
#define FLASH_DF_BLOCK_109_MACRO  (0x00101B40)    /*   64B: 0x00101B40 - 0x00101B7F */
#define FLASH_DF_BLOCK_110_MACRO  (0x00101B80)    /*   64B: 0x00101B80 - 0x00101BBF */
#define FLASH_DF_BLOCK_111_MACRO  (0x00101BC0)    /*   64B: 0x00101BC0 - 0x00101BFF */
#define FLASH_DF_BLOCK_112_MACRO  (0x00101C00)    /*   64B: 0x00101C00 - 0x00101C3F */
#define FLASH_DF_BLOCK_113_MACRO  (0x00101C40)    /*   64B: 0x00101C40 - 0x00101C7F */
#define FLASH_DF_BLOCK_114_MACRO  (0x00101C80)    /*   64B: 0x00101C80 - 0x00101CBF */
#define FLASH_DF_BLOCK_115_MACRO  (0x00101CC0)    /*   64B: 0x00101CC0 - 0x00101CFF */
#define FLASH_DF_BLOCK_116_MACRO  (0x00101D00)    /*   64B: 0x00101D00 - 0x00101D3F */
#define FLASH_DF_BLOCK_117_MACRO  (0x00101D40)    /*   64B: 0x00101D40 - 0x00101D7F */
#define FLASH_DF_BLOCK_118_MACRO  (0x00101D80)    /*   64B: 0x00101D80 - 0x00101DBF */
#define FLASH_DF_BLOCK_119_MACRO  (0x00101DC0)    /*   64B: 0x00101DC0 - 0x00101DFF */
#define FLASH_DF_BLOCK_120_MACRO  (0x00101E00)    /*   64B: 0x00101E00 - 0x00101E3F */
#define FLASH_DF_BLOCK_121_MACRO  (0x00101E40)    /*   64B: 0x00101E40 - 0x00101E7F */
#define FLASH_DF_BLOCK_122_MACRO  (0x00101E80)    /*   64B: 0x00101E80 - 0x00101EBF */
#define FLASH_DF_BLOCK_123_MACRO  (0x00101EC0)    /*   64B: 0x00101EC0 - 0x00101EFF */
#define FLASH_DF_BLOCK_124_MACRO  (0x00101F00)    /*   64B: 0x00101F00 - 0x00101F3F */
#define FLASH_DF_BLOCK_125_MACRO  (0x00101F40)    /*   64B: 0x00101F40 - 0x00101F7F */
#define FLASH_DF_BLOCK_126_MACRO  (0x00101F80)    /*   64B: 0x00101F80 - 0x00101FBF */
#define FLASH_DF_BLOCK_127_MACRO  (0x00101FC0)    /*   64B: 0x00101FC0 - 0x00101FFF */
#define FLASH_DF_BLOCK_128_MACRO  (0x00102000)    /*   64B: 0x00102000 - 0x0010203F */
#define FLASH_DF_BLOCK_129_MACRO  (0x00102040)    /*   64B: 0x00102040 - 0x0010207F */
#define FLASH_DF_BLOCK_130_MACRO  (0x00102080)    /*   64B: 0x00102080 - 0x001020BF */
#define FLASH_DF_BLOCK_131_MACRO  (0x001020C0)    /*   64B: 0x001020C0 - 0x001020FF */
#define FLASH_DF_BLOCK_132_MACRO  (0x00102100)    /*   64B: 0x00102100 - 0x0010213F */
#define FLASH_DF_BLOCK_133_MACRO  (0x00102140)    /*   64B: 0x00102140 - 0x0010217F */
#define FLASH_DF_BLOCK_134_MACRO  (0x00102180)    /*   64B: 0x00102180 - 0x001021BF */
#define FLASH_DF_BLOCK_135_MACRO  (0x001021C0)    /*   64B: 0x001021C0 - 0x001021FF */
#define FLASH_DF_BLOCK_136_MACRO  (0x00102200)    /*   64B: 0x00102200 - 0x0010223F */
#define FLASH_DF_BLOCK_137_MACRO  (0x00102240)    /*   64B: 0x00102240 - 0x0010227F */
#define FLASH_DF_BLOCK_138_MACRO  (0x00102280)    /*   64B: 0x00102280 - 0x001022BF */
#define FLASH_DF_BLOCK_139_MACRO  (0x001022C0)    /*   64B: 0x001022C0 - 0x001022FF */
#define FLASH_DF_BLOCK_140_MACRO  (0x00102300)    /*   64B: 0x00102300 - 0x0010233F */
#define FLASH_DF_BLOCK_141_MACRO  (0x00102340)    /*   64B: 0x00102340 - 0x0010237F */
#define FLASH_DF_BLOCK_142_MACRO  (0x00102380)    /*   64B: 0x00102380 - 0x001023BF */
#define FLASH_DF_BLOCK_143_MACRO  (0x001023C0)    /*   64B: 0x001023C0 - 0x001023FF */
#define FLASH_DF_BLOCK_144_MACRO  (0x00102400)    /*   64B: 0x00102400 - 0x0010243F */
#define FLASH_DF_BLOCK_145_MACRO  (0x00102440)    /*   64B: 0x00102440 - 0x0010247F */
#define FLASH_DF_BLOCK_146_MACRO  (0x00102480)    /*   64B: 0x00102480 - 0x001024BF */
#define FLASH_DF_BLOCK_147_MACRO  (0x001024C0)    /*   64B: 0x001024C0 - 0x001024FF */
#define FLASH_DF_BLOCK_148_MACRO  (0x00102500)    /*   64B: 0x00102500 - 0x0010253F */
#define FLASH_DF_BLOCK_149_MACRO  (0x00102540)    /*   64B: 0x00102540 - 0x0010257F */
#define FLASH_DF_BLOCK_150_MACRO  (0x00102580)    /*   64B: 0x00102580 - 0x001025BF */
#define FLASH_DF_BLOCK_151_MACRO  (0x001025C0)    /*   64B: 0x001025C0 - 0x001025FF */
#define FLASH_DF_BLOCK_152_MACRO  (0x00102600)    /*   64B: 0x00102600 - 0x0010263F */
#define FLASH_DF_BLOCK_153_MACRO  (0x00102640)    /*   64B: 0x00102640 - 0x0010267F */
#define FLASH_DF_BLOCK_154_MACRO  (0x00102680)    /*   64B: 0x00102680 - 0x001026BF */
#define FLASH_DF_BLOCK_155_MACRO  (0x001026C0)    /*   64B: 0x001026C0 - 0x001026FF */
#define FLASH_DF_BLOCK_156_MACRO  (0x00102700)    /*   64B: 0x00102700 - 0x0010273F */
#define FLASH_DF_BLOCK_157_MACRO  (0x00102740)    /*   64B: 0x00102740 - 0x0010277F */
#define FLASH_DF_BLOCK_158_MACRO  (0x00102780)    /*   64B: 0x00102780 - 0x001027BF */
#define FLASH_DF_BLOCK_159_MACRO  (0x001027C0)    /*   64B: 0x001027C0 - 0x001027FF */
#define FLASH_DF_BLOCK_160_MACRO  (0x00102800)    /*   64B: 0x00102800 - 0x0010283F */
#define FLASH_DF_BLOCK_161_MACRO  (0x00102840)    /*   64B: 0x00102840 - 0x0010287F */
#define FLASH_DF_BLOCK_162_MACRO  (0x00102880)    /*   64B: 0x00102880 - 0x001028BF */
#define FLASH_DF_BLOCK_163_MACRO  (0x001028C0)    /*   64B: 0x001028C0 - 0x001028FF */
#define FLASH_DF_BLOCK_164_MACRO  (0x00102900)    /*   64B: 0x00102900 - 0x0010293F */
#define FLASH_DF_BLOCK_165_MACRO  (0x00102940)    /*   64B: 0x00102940 - 0x0010297F */
#define FLASH_DF_BLOCK_166_MACRO  (0x00102980)    /*   64B: 0x00102980 - 0x001029BF */
#define FLASH_DF_BLOCK_167_MACRO  (0x001029C0)    /*   64B: 0x001029C0 - 0x001029FF */
#define FLASH_DF_BLOCK_168_MACRO  (0x00102A00)    /*   64B: 0x00102A00 - 0x00102A3F */
#define FLASH_DF_BLOCK_169_MACRO  (0x00102A40)    /*   64B: 0x00102A40 - 0x00102A7F */
#define FLASH_DF_BLOCK_170_MACRO  (0x00102A80)    /*   64B: 0x00102A80 - 0x00102ABF */
#define FLASH_DF_BLOCK_171_MACRO  (0x00102AC0)    /*   64B: 0x00102AC0 - 0x00102AFF */
#define FLASH_DF_BLOCK_172_MACRO  (0x00102B00)    /*   64B: 0x00102B00 - 0x00102B3F */
#define FLASH_DF_BLOCK_173_MACRO  (0x00102B40)    /*   64B: 0x00102B40 - 0x00102B7F */
#define FLASH_DF_BLOCK_174_MACRO  (0x00102B80)    /*   64B: 0x00102B80 - 0x00102BBF */
#define FLASH_DF_BLOCK_175_MACRO  (0x00102BC0)    /*   64B: 0x00102BC0 - 0x00102BFF */
#define FLASH_DF_BLOCK_176_MACRO  (0x00102C00)    /*   64B: 0x00102C00 - 0x00102C3F */
#define FLASH_DF_BLOCK_177_MACRO  (0x00102C40)    /*   64B: 0x00102C40 - 0x00102C7F */
#define FLASH_DF_BLOCK_178_MACRO  (0x00102C80)    /*   64B: 0x00102C80 - 0x00102CBF */
#define FLASH_DF_BLOCK_179_MACRO  (0x00102CC0)    /*   64B: 0x00102CC0 - 0x00102CFF */
#define FLASH_DF_BLOCK_180_MACRO  (0x00102D00)    /*   64B: 0x00102D00 - 0x00102D3F */
#define FLASH_DF_BLOCK_181_MACRO  (0x00102D40)    /*   64B: 0x00102D40 - 0x00102D7F */
#define FLASH_DF_BLOCK_182_MACRO  (0x00102D80)    /*   64B: 0x00102D80 - 0x00102DBF */
#define FLASH_DF_BLOCK_183_MACRO  (0x00102DC0)    /*   64B: 0x00102DC0 - 0x00102DFF */
#define FLASH_DF_BLOCK_184_MACRO  (0x00102E00)    /*   64B: 0x00102E00 - 0x00102E3F */
#define FLASH_DF_BLOCK_185_MACRO  (0x00102E40)    /*   64B: 0x00102E40 - 0x00102E7F */
#define FLASH_DF_BLOCK_186_MACRO  (0x00102E80)    /*   64B: 0x00102E80 - 0x00102EBF */
#define FLASH_DF_BLOCK_187_MACRO  (0x00102EC0)    /*   64B: 0x00102EC0 - 0x00102EFF */
#define FLASH_DF_BLOCK_188_MACRO  (0x00102F00)    /*   64B: 0x00102F00 - 0x00102F3F */
#define FLASH_DF_BLOCK_189_MACRO  (0x00102F40)    /*   64B: 0x00102F40 - 0x00102F7F */
#define FLASH_DF_BLOCK_190_MACRO  (0x00102F80)    /*   64B: 0x00102F80 - 0x00102FBF */
#define FLASH_DF_BLOCK_191_MACRO  (0x00102FC0)    /*   64B: 0x00102FC0 - 0x00102FFF */
#define FLASH_DF_BLOCK_192_MACRO  (0x00103000)    /*   64B: 0x00103000 - 0x0010303F */
#define FLASH_DF_BLOCK_193_MACRO  (0x00103040)    /*   64B: 0x00103040 - 0x0010307F */
#define FLASH_DF_BLOCK_194_MACRO  (0x00103080)    /*   64B: 0x00103080 - 0x001030BF */
#define FLASH_DF_BLOCK_195_MACRO  (0x001030C0)    /*   64B: 0x001030C0 - 0x001030FF */
#define FLASH_DF_BLOCK_196_MACRO  (0x00103100)    /*   64B: 0x00103100 - 0x0010313F */
#define FLASH_DF_BLOCK_197_MACRO  (0x00103140)    /*   64B: 0x00103140 - 0x0010317F */
#define FLASH_DF_BLOCK_198_MACRO  (0x00103180)    /*   64B: 0x00103180 - 0x001031BF */
#define FLASH_DF_BLOCK_199_MACRO  (0x001031C0)    /*   64B: 0x001031C0 - 0x001031FF */
#define FLASH_DF_BLOCK_200_MACRO  (0x00103200)    /*   64B: 0x00103200 - 0x0010323F */
#define FLASH_DF_BLOCK_201_MACRO  (0x00103240)    /*   64B: 0x00103240 - 0x0010327F */
#define FLASH_DF_BLOCK_202_MACRO  (0x00103280)    /*   64B: 0x00103280 - 0x001032BF */
#define FLASH_DF_BLOCK_203_MACRO  (0x001032C0)    /*   64B: 0x001032C0 - 0x001032FF */
#define FLASH_DF_BLOCK_204_MACRO  (0x00103300)    /*   64B: 0x00103300 - 0x0010333F */
#define FLASH_DF_BLOCK_205_MACRO  (0x00103340)    /*   64B: 0x00103340 - 0x0010337F */
#define FLASH_DF_BLOCK_206_MACRO  (0x00103380)    /*   64B: 0x00103380 - 0x001033BF */
#define FLASH_DF_BLOCK_207_MACRO  (0x001033C0)    /*   64B: 0x001033C0 - 0x001033FF */
#define FLASH_DF_BLOCK_208_MACRO  (0x00103400)    /*   64B: 0x00103400 - 0x0010343F */
#define FLASH_DF_BLOCK_209_MACRO  (0x00103440)    /*   64B: 0x00103440 - 0x0010347F */
#define FLASH_DF_BLOCK_210_MACRO  (0x00103480)    /*   64B: 0x00103480 - 0x001034BF */
#define FLASH_DF_BLOCK_211_MACRO  (0x001034C0)    /*   64B: 0x001034C0 - 0x001034FF */
#define FLASH_DF_BLOCK_212_MACRO  (0x00103500)    /*   64B: 0x00103500 - 0x0010353F */
#define FLASH_DF_BLOCK_213_MACRO  (0x00103540)    /*   64B: 0x00103540 - 0x0010357F */
#define FLASH_DF_BLOCK_214_MACRO  (0x00103580)    /*   64B: 0x00103580 - 0x001035BF */
#define FLASH_DF_BLOCK_215_MACRO  (0x001035C0)    /*   64B: 0x001035C0 - 0x001035FF */
#define FLASH_DF_BLOCK_216_MACRO  (0x00103600)    /*   64B: 0x00103600 - 0x0010363F */
#define FLASH_DF_BLOCK_217_MACRO  (0x00103640)    /*   64B: 0x00103640 - 0x0010367F */
#define FLASH_DF_BLOCK_218_MACRO  (0x00103680)    /*   64B: 0x00103680 - 0x001036BF */
#define FLASH_DF_BLOCK_219_MACRO  (0x001036C0)    /*   64B: 0x001036C0 - 0x001036FF */
#define FLASH_DF_BLOCK_220_MACRO  (0x00103700)    /*   64B: 0x00103700 - 0x0010373F */
#define FLASH_DF_BLOCK_221_MACRO  (0x00103740)    /*   64B: 0x00103740 - 0x0010377F */
#define FLASH_DF_BLOCK_222_MACRO  (0x00103780)    /*   64B: 0x00103780 - 0x001037BF */
#define FLASH_DF_BLOCK_223_MACRO  (0x001037C0)    /*   64B: 0x001037C0 - 0x001037FF */
#define FLASH_DF_BLOCK_224_MACRO  (0x00103800)    /*   64B: 0x00103800 - 0x0010383F */
#define FLASH_DF_BLOCK_225_MACRO  (0x00103840)    /*   64B: 0x00103840 - 0x0010387F */
#define FLASH_DF_BLOCK_226_MACRO  (0x00103880)    /*   64B: 0x00103880 - 0x001038BF */
#define FLASH_DF_BLOCK_227_MACRO  (0x001038C0)    /*   64B: 0x001038C0 - 0x001038FF */
#define FLASH_DF_BLOCK_228_MACRO  (0x00103900)    /*   64B: 0x00103900 - 0x0010393F */
#define FLASH_DF_BLOCK_229_MACRO  (0x00103940)    /*   64B: 0x00103940 - 0x0010397F */
#define FLASH_DF_BLOCK_230_MACRO  (0x00103980)    /*   64B: 0x00103980 - 0x001039BF */
#define FLASH_DF_BLOCK_231_MACRO  (0x001039C0)    /*   64B: 0x001039C0 - 0x001039FF */
#define FLASH_DF_BLOCK_232_MACRO  (0x00103A00)    /*   64B: 0x00103A00 - 0x00103A3F */
#define FLASH_DF_BLOCK_233_MACRO  (0x00103A40)    /*   64B: 0x00103A40 - 0x00103A7F */
#define FLASH_DF_BLOCK_234_MACRO  (0x00103A80)    /*   64B: 0x00103A80 - 0x00103ABF */
#define FLASH_DF_BLOCK_235_MACRO  (0x00103AC0)    /*   64B: 0x00103AC0 - 0x00103AFF */
#define FLASH_DF_BLOCK_236_MACRO  (0x00103B00)    /*   64B: 0x00103B00 - 0x00103B3F */
#define FLASH_DF_BLOCK_237_MACRO  (0x00103B40)    /*   64B: 0x00103B40 - 0x00103B7F */
#define FLASH_DF_BLOCK_238_MACRO  (0x00103B80)    /*   64B: 0x00103B80 - 0x00103BBF */
#define FLASH_DF_BLOCK_239_MACRO  (0x00103BC0)    /*   64B: 0x00103BC0 - 0x00103BFF */
#define FLASH_DF_BLOCK_240_MACRO  (0x00103C00)    /*   64B: 0x00103C00 - 0x00103C3F */
#define FLASH_DF_BLOCK_241_MACRO  (0x00103C40)    /*   64B: 0x00103C40 - 0x00103C7F */
#define FLASH_DF_BLOCK_242_MACRO  (0x00103C80)    /*   64B: 0x00103C80 - 0x00103CBF */
#define FLASH_DF_BLOCK_243_MACRO  (0x00103CC0)    /*   64B: 0x00103CC0 - 0x00103CFF */
#define FLASH_DF_BLOCK_244_MACRO  (0x00103D00)    /*   64B: 0x00103D00 - 0x00103D3F */
#define FLASH_DF_BLOCK_245_MACRO  (0x00103D40)    /*   64B: 0x00103D40 - 0x00103D7F */
#define FLASH_DF_BLOCK_246_MACRO  (0x00103D80)    /*   64B: 0x00103D80 - 0x00103DBF */
#define FLASH_DF_BLOCK_247_MACRO  (0x00103DC0)    /*   64B: 0x00103DC0 - 0x00103DFF */
#define FLASH_DF_BLOCK_248_MACRO  (0x00103E00)    /*   64B: 0x00103E00 - 0x00103E3F */
#define FLASH_DF_BLOCK_249_MACRO  (0x00103E40)    /*   64B: 0x00103E40 - 0x00103E7F */
#define FLASH_DF_BLOCK_250_MACRO  (0x00103E80)    /*   64B: 0x00103E80 - 0x00103EBF */
#define FLASH_DF_BLOCK_251_MACRO  (0x00103EC0)    /*   64B: 0x00103EC0 - 0x00103EFF */
#define FLASH_DF_BLOCK_252_MACRO  (0x00103F00)    /*   64B: 0x00103F00 - 0x00103F3F */
#define FLASH_DF_BLOCK_253_MACRO  (0x00103F40)    /*   64B: 0x00103F40 - 0x00103F7F */
#define FLASH_DF_BLOCK_254_MACRO  (0x00103F80)    /*   64B: 0x00103F80 - 0x00103FBF */
#define FLASH_DF_BLOCK_255_MACRO  (0x00103FC0)    /*   64B: 0x00103FC0 - 0x00103FFF */
#define FLASH_DF_BLOCK_256_MACRO  (0x00104000)    /*   64B: 0x00104000 - 0x0010403F */
#define FLASH_DF_BLOCK_257_MACRO  (0x00104040)    /*   64B: 0x00104040 - 0x0010407F */
#define FLASH_DF_BLOCK_258_MACRO  (0x00104080)    /*   64B: 0x00104080 - 0x001040BF */
#define FLASH_DF_BLOCK_259_MACRO  (0x001040C0)    /*   64B: 0x001040C0 - 0x001040FF */
#define FLASH_DF_BLOCK_260_MACRO  (0x00104100)    /*   64B: 0x00104100 - 0x0010413F */
#define FLASH_DF_BLOCK_261_MACRO  (0x00104140)    /*   64B: 0x00104140 - 0x0010417F */
#define FLASH_DF_BLOCK_262_MACRO  (0x00104180)    /*   64B: 0x00104180 - 0x001041BF */
#define FLASH_DF_BLOCK_263_MACRO  (0x001041C0)    /*   64B: 0x001041C0 - 0x001041FF */
#define FLASH_DF_BLOCK_264_MACRO  (0x00104200)    /*   64B: 0x00104200 - 0x0010423F */
