renesas/iot-reference-rx/Common/littlefs_common/rm_littlefs_df/targets/rx65n/rm_littlefs_df_rx65n.h
#define FLASH_DF_BLOCK_265_MACRO  (0x00104240)    /*   64B: 0x00104240 - 0x0010427F */
#define FLASH_DF_BLOCK_266_MACRO  (0x00104280)    /*   64B: 0x00104280 - 0x001042BF */
#define FLASH_DF_BLOCK_267_MACRO  (0x001042C0)    /*   64B: 0x001042C0 - 0x001042FF */
#define FLASH_DF_BLOCK_268_MACRO  (0x00104300)    /*   64B: 0x00104300 - 0x0010433F */
#define FLASH_DF_BLOCK_269_MACRO  (0x00104340)    /*   64B: 0x00104340 - 0x0010437F */
#define FLASH_DF_BLOCK_270_MACRO  (0x00104380)    /*   64B: 0x00104380 - 0x001043BF */
#define FLASH_DF_BLOCK_271_MACRO  (0x001043C0)    /*   64B: 0x001043C0 - 0x001043FF */
#define FLASH_DF_BLOCK_272_MACRO  (0x00104400)    /*   64B: 0x00104400 - 0x0010443F */
#define FLASH_DF_BLOCK_273_MACRO  (0x00104440)    /*   64B: 0x00104440 - 0x0010447F */
#define FLASH_DF_BLOCK_274_MACRO  (0x00104480)    /*   64B: 0x00104480 - 0x001044BF */
#define FLASH_DF_BLOCK_275_MACRO  (0x001044C0)    /*   64B: 0x001044C0 - 0x001044FF */
#define FLASH_DF_BLOCK_276_MACRO  (0x00104500)    /*   64B: 0x00104500 - 0x0010453F */
#define FLASH_DF_BLOCK_277_MACRO  (0x00104540)    /*   64B: 0x00104540 - 0x0010457F */
#define FLASH_DF_BLOCK_278_MACRO  (0x00104580)    /*   64B: 0x00104580 - 0x001045BF */
#define FLASH_DF_BLOCK_279_MACRO  (0x001045C0)    /*   64B: 0x001045C0 - 0x001045FF */
#define FLASH_DF_BLOCK_280_MACRO  (0x00104600)    /*   64B: 0x00104600 - 0x0010463F */
#define FLASH_DF_BLOCK_281_MACRO  (0x00104640)    /*   64B: 0x00104640 - 0x0010467F */
#define FLASH_DF_BLOCK_282_MACRO  (0x00104680)    /*   64B: 0x00104680 - 0x001046BF */
#define FLASH_DF_BLOCK_283_MACRO  (0x001046C0)    /*   64B: 0x001046C0 - 0x001046FF */
#define FLASH_DF_BLOCK_284_MACRO  (0x00104700)    /*   64B: 0x00104700 - 0x0010473F */
#define FLASH_DF_BLOCK_285_MACRO  (0x00104740)    /*   64B: 0x00104740 - 0x0010477F */
#define FLASH_DF_BLOCK_286_MACRO  (0x00104780)    /*   64B: 0x00104780 - 0x001047BF */
#define FLASH_DF_BLOCK_287_MACRO  (0x001047C0)    /*   64B: 0x001047C0 - 0x001047FF */
#define FLASH_DF_BLOCK_288_MACRO  (0x00104800)    /*   64B: 0x00104800 - 0x0010483F */
#define FLASH_DF_BLOCK_289_MACRO  (0x00104840)    /*   64B: 0x00104840 - 0x0010487F */
#define FLASH_DF_BLOCK_290_MACRO  (0x00104880)    /*   64B: 0x00104880 - 0x001048BF */
#define FLASH_DF_BLOCK_291_MACRO  (0x001048C0)    /*   64B: 0x001048C0 - 0x001048FF */
#define FLASH_DF_BLOCK_292_MACRO  (0x00104900)    /*   64B: 0x00104900 - 0x0010493F */
#define FLASH_DF_BLOCK_293_MACRO  (0x00104940)    /*   64B: 0x00104940 - 0x0010497F */
#define FLASH_DF_BLOCK_294_MACRO  (0x00104980)    /*   64B: 0x00104980 - 0x001049BF */
#define FLASH_DF_BLOCK_295_MACRO  (0x001049C0)    /*   64B: 0x001049C0 - 0x001049FF */
#define FLASH_DF_BLOCK_296_MACRO  (0x00104A00)    /*   64B: 0x00104A00 - 0x00104A3F */
#define FLASH_DF_BLOCK_297_MACRO  (0x00104A40)    /*   64B: 0x00104A40 - 0x00104A7F */
#define FLASH_DF_BLOCK_298_MACRO  (0x00104A80)    /*   64B: 0x00104A80 - 0x00104ABF */
#define FLASH_DF_BLOCK_299_MACRO  (0x00104AC0)    /*   64B: 0x00104AC0 - 0x00104AFF */
#define FLASH_DF_BLOCK_300_MACRO  (0x00104B00)    /*   64B: 0x00104B00 - 0x00104B3F */
#define FLASH_DF_BLOCK_301_MACRO  (0x00104B40)    /*   64B: 0x00104B40 - 0x00104B7F */
#define FLASH_DF_BLOCK_302_MACRO  (0x00104B80)    /*   64B: 0x00104B80 - 0x00104BBF */
#define FLASH_DF_BLOCK_303_MACRO  (0x00104BC0)    /*   64B: 0x00104BC0 - 0x00104BFF */
#define FLASH_DF_BLOCK_304_MACRO  (0x00104C00)    /*   64B: 0x00104C00 - 0x00104C3F */
#define FLASH_DF_BLOCK_305_MACRO  (0x00104C40)    /*   64B: 0x00104C40 - 0x00104C7F */
#define FLASH_DF_BLOCK_306_MACRO  (0x00104C80)    /*   64B: 0x00104C80 - 0x00104CBF */
#define FLASH_DF_BLOCK_307_MACRO  (0x00104CC0)    /*   64B: 0x00104CC0 - 0x00104CFF */
#define FLASH_DF_BLOCK_308_MACRO  (0x00104D00)    /*   64B: 0x00104D00 - 0x00104D3F */
#define FLASH_DF_BLOCK_309_MACRO  (0x00104D40)    /*   64B: 0x00104D40 - 0x00104D7F */
#define FLASH_DF_BLOCK_310_MACRO  (0x00104D80)    /*   64B: 0x00104D80 - 0x00104DBF */
#define FLASH_DF_BLOCK_311_MACRO  (0x00104DC0)    /*   64B: 0x00104DC0 - 0x00104DFF */
#define FLASH_DF_BLOCK_312_MACRO  (0x00104E00)    /*   64B: 0x00104E00 - 0x00104E3F */
#define FLASH_DF_BLOCK_313_MACRO  (0x00104E40)    /*   64B: 0x00104E40 - 0x00104E7F */
#define FLASH_DF_BLOCK_314_MACRO  (0x00104E80)    /*   64B: 0x00104E80 - 0x00104EBF */
#define FLASH_DF_BLOCK_315_MACRO  (0x00104EC0)    /*   64B: 0x00104EC0 - 0x00104EFF */
#define FLASH_DF_BLOCK_316_MACRO  (0x00104F00)    /*   64B: 0x00104F00 - 0x00104F3F */
#define FLASH_DF_BLOCK_317_MACRO  (0x00104F40)    /*   64B: 0x00104F40 - 0x00104F7F */
#define FLASH_DF_BLOCK_318_MACRO  (0x00104F80)    /*   64B: 0x00104F80 - 0x00104FBF */
#define FLASH_DF_BLOCK_319_MACRO  (0x00104FC0)    /*   64B: 0x00104FC0 - 0x00104FFF */
#define FLASH_DF_BLOCK_320_MACRO  (0x00105000)    /*   64B: 0x00105000 - 0x0010503F */
#define FLASH_DF_BLOCK_321_MACRO  (0x00105040)    /*   64B: 0x00105040 - 0x0010507F */
#define FLASH_DF_BLOCK_322_MACRO  (0x00105080)    /*   64B: 0x00105080 - 0x001050BF */
#define FLASH_DF_BLOCK_323_MACRO  (0x001050C0)    /*   64B: 0x001050C0 - 0x001050FF */
#define FLASH_DF_BLOCK_324_MACRO  (0x00105100)    /*   64B: 0x00105100 - 0x0010513F */
#define FLASH_DF_BLOCK_325_MACRO  (0x00105140)    /*   64B: 0x00105140 - 0x0010517F */
#define FLASH_DF_BLOCK_326_MACRO  (0x00105180)    /*   64B: 0x00105180 - 0x001051BF */
#define FLASH_DF_BLOCK_327_MACRO  (0x001051C0)    /*   64B: 0x001051C0 - 0x001051FF */
#define FLASH_DF_BLOCK_328_MACRO  (0x00105200)    /*   64B: 0x00105200 - 0x0010523F */
#define FLASH_DF_BLOCK_329_MACRO  (0x00105240)    /*   64B: 0x00105240 - 0x0010527F */
#define FLASH_DF_BLOCK_330_MACRO  (0x00105280)    /*   64B: 0x00105280 - 0x001052BF */
#define FLASH_DF_BLOCK_331_MACRO  (0x001052C0)    /*   64B: 0x001052C0 - 0x001052FF */
#define FLASH_DF_BLOCK_332_MACRO  (0x00105300)    /*   64B: 0x00105300 - 0x0010533F */
#define FLASH_DF_BLOCK_333_MACRO  (0x00105340)    /*   64B: 0x00105340 - 0x0010537F */
#define FLASH_DF_BLOCK_334_MACRO  (0x00105380)    /*   64B: 0x00105380 - 0x001053BF */
#define FLASH_DF_BLOCK_335_MACRO  (0x001053C0)    /*   64B: 0x001053C0 - 0x001053FF */
#define FLASH_DF_BLOCK_336_MACRO  (0x00105400)    /*   64B: 0x00105400 - 0x0010543F */
#define FLASH_DF_BLOCK_337_MACRO  (0x00105440)    /*   64B: 0x00105440 - 0x0010547F */
#define FLASH_DF_BLOCK_338_MACRO  (0x00105480)    /*   64B: 0x00105480 - 0x001054BF */
#define FLASH_DF_BLOCK_339_MACRO  (0x001054C0)    /*   64B: 0x001054C0 - 0x001054FF */
#define FLASH_DF_BLOCK_340_MACRO  (0x00105500)    /*   64B: 0x00105500 - 0x0010553F */
#define FLASH_DF_BLOCK_341_MACRO  (0x00105540)    /*   64B: 0x00105540 - 0x0010557F */
#define FLASH_DF_BLOCK_342_MACRO  (0x00105580)    /*   64B: 0x00105580 - 0x001055BF */
#define FLASH_DF_BLOCK_343_MACRO  (0x001055C0)    /*   64B: 0x001055C0 - 0x001055FF */
#define FLASH_DF_BLOCK_344_MACRO  (0x00105600)    /*   64B: 0x00105600 - 0x0010563F */
#define FLASH_DF_BLOCK_345_MACRO  (0x00105640)    /*   64B: 0x00105640 - 0x0010567F */
#define FLASH_DF_BLOCK_346_MACRO  (0x00105680)    /*   64B: 0x00105680 - 0x001056BF */
#define FLASH_DF_BLOCK_347_MACRO  (0x001056C0)    /*   64B: 0x001056C0 - 0x001056FF */
#define FLASH_DF_BLOCK_348_MACRO  (0x00105700)    /*   64B: 0x00105700 - 0x0010573F */
#define FLASH_DF_BLOCK_349_MACRO  (0x00105740)    /*   64B: 0x00105740 - 0x0010577F */
#define FLASH_DF_BLOCK_350_MACRO  (0x00105780)    /*   64B: 0x00105780 - 0x001057BF */
#define FLASH_DF_BLOCK_351_MACRO  (0x001057C0)    /*   64B: 0x001057C0 - 0x001057FF */
#define FLASH_DF_BLOCK_352_MACRO  (0x00105800)    /*   64B: 0x00105800 - 0x0010583F */
#define FLASH_DF_BLOCK_353_MACRO  (0x00105840)    /*   64B: 0x00105840 - 0x0010587F */
#define FLASH_DF_BLOCK_354_MACRO  (0x00105880)    /*   64B: 0x00105880 - 0x001058BF */
#define FLASH_DF_BLOCK_355_MACRO  (0x001058C0)    /*   64B: 0x001058C0 - 0x001058FF */
#define FLASH_DF_BLOCK_356_MACRO  (0x00105900)    /*   64B: 0x00105900 - 0x0010593F */
#define FLASH_DF_BLOCK_357_MACRO  (0x00105940)    /*   64B: 0x00105940 - 0x0010597F */
#define FLASH_DF_BLOCK_358_MACRO  (0x00105980)    /*   64B: 0x00105980 - 0x001059BF */
#define FLASH_DF_BLOCK_359_MACRO  (0x001059C0)    /*   64B: 0x001059C0 - 0x001059FF */
#define FLASH_DF_BLOCK_360_MACRO  (0x00105A00)    /*   64B: 0x00105A00 - 0x00105A3F */
#define FLASH_DF_BLOCK_361_MACRO  (0x00105A40)    /*   64B: 0x00105A40 - 0x00105A7F */
#define FLASH_DF_BLOCK_362_MACRO  (0x00105A80)    /*   64B: 0x00105A80 - 0x00105ABF */
#define FLASH_DF_BLOCK_363_MACRO  (0x00105AC0)    /*   64B: 0x00105AC0 - 0x00105AFF */
#define FLASH_DF_BLOCK_364_MACRO  (0x00105B00)    /*   64B: 0x00105B00 - 0x00105B3F */
#define FLASH_DF_BLOCK_365_MACRO  (0x00105B40)    /*   64B: 0x00105B40 - 0x00105B7F */
#define FLASH_DF_BLOCK_366_MACRO  (0x00105B80)    /*   64B: 0x00105B80 - 0x00105BBF */
#define FLASH_DF_BLOCK_367_MACRO  (0x00105BC0)    /*   64B: 0x00105BC0 - 0x00105BFF */
#define FLASH_DF_BLOCK_368_MACRO  (0x00105C00)    /*   64B: 0x00105C00 - 0x00105C3F */
#define FLASH_DF_BLOCK_369_MACRO  (0x00105C40)    /*   64B: 0x00105C40 - 0x00105C7F */
#define FLASH_DF_BLOCK_370_MACRO  (0x00105C80)    /*   64B: 0x00105C80 - 0x00105CBF */
#define FLASH_DF_BLOCK_371_MACRO  (0x00105CC0)    /*   64B: 0x00105CC0 - 0x00105CFF */
#define FLASH_DF_BLOCK_372_MACRO  (0x00105D00)    /*   64B: 0x00105D00 - 0x00105D3F */
#define FLASH_DF_BLOCK_373_MACRO  (0x00105D40)    /*   64B: 0x00105D40 - 0x00105D7F */
#define FLASH_DF_BLOCK_374_MACRO  (0x00105D80)    /*   64B: 0x00105D80 - 0x00105DBF */
#define FLASH_DF_BLOCK_375_MACRO  (0x00105DC0)    /*   64B: 0x00105DC0 - 0x00105DFF */
#define FLASH_DF_BLOCK_376_MACRO  (0x00105E00)    /*   64B: 0x00105E00 - 0x00105E3F */
#define FLASH_DF_BLOCK_377_MACRO  (0x00105E40)    /*   64B: 0x00105E40 - 0x00105E7F */
#define FLASH_DF_BLOCK_378_MACRO  (0x00105E80)    /*   64B: 0x00105E80 - 0x00105EBF */
#define FLASH_DF_BLOCK_379_MACRO  (0x00105EC0)    /*   64B: 0x00105EC0 - 0x00105EFF */
#define FLASH_DF_BLOCK_380_MACRO  (0x00105F00)    /*   64B: 0x00105F00 - 0x00105F3F */
#define FLASH_DF_BLOCK_381_MACRO  (0x00105F40)    /*   64B: 0x00105F40 - 0x00105F7F */
#define FLASH_DF_BLOCK_382_MACRO  (0x00105F80)    /*   64B: 0x00105F80 - 0x00105FBF */
#define FLASH_DF_BLOCK_383_MACRO  (0x00105FC0)    /*   64B: 0x00105FC0 - 0x00105FFF */
#define FLASH_DF_BLOCK_384_MACRO  (0x00106000)    /*   64B: 0x00106000 - 0x0010603F */
#define FLASH_DF_BLOCK_385_MACRO  (0x00106040)    /*   64B: 0x00106040 - 0x0010607F */
#define FLASH_DF_BLOCK_386_MACRO  (0x00106080)    /*   64B: 0x00106080 - 0x001060BF */
#define FLASH_DF_BLOCK_387_MACRO  (0x001060C0)    /*   64B: 0x001060C0 - 0x001060FF */
#define FLASH_DF_BLOCK_388_MACRO  (0x00106100)    /*   64B: 0x00106100 - 0x0010613F */
#define FLASH_DF_BLOCK_389_MACRO  (0x00106140)    /*   64B: 0x00106140 - 0x0010617F */
#define FLASH_DF_BLOCK_390_MACRO  (0x00106180)    /*   64B: 0x00106180 - 0x001061BF */
#define FLASH_DF_BLOCK_391_MACRO  (0x001061C0)    /*   64B: 0x001061C0 - 0x001061FF */
#define FLASH_DF_BLOCK_392_MACRO  (0x00106200)    /*   64B: 0x00106200 - 0x0010623F */
#define FLASH_DF_BLOCK_393_MACRO  (0x00106240)    /*   64B: 0x00106240 - 0x0010627F */
#define FLASH_DF_BLOCK_394_MACRO  (0x00106280)    /*   64B: 0x00106280 - 0x001062BF */
#define FLASH_DF_BLOCK_395_MACRO  (0x001062C0)    /*   64B: 0x001062C0 - 0x001062FF */
#define FLASH_DF_BLOCK_396_MACRO  (0x00106300)    /*   64B: 0x00106300 - 0x0010633F */
#define FLASH_DF_BLOCK_397_MACRO  (0x00106340)    /*   64B: 0x00106340 - 0x0010637F */
#define FLASH_DF_BLOCK_398_MACRO  (0x00106380)    /*   64B: 0x00106380 - 0x001063BF */
#define FLASH_DF_BLOCK_399_MACRO  (0x001063C0)    /*   64B: 0x001063C0 - 0x001063FF */
#define FLASH_DF_BLOCK_400_MACRO  (0x00106400)    /*   64B: 0x00106400 - 0x0010643F */
#define FLASH_DF_BLOCK_401_MACRO  (0x00106440)    /*   64B: 0x00106440 - 0x0010647F */
#define FLASH_DF_BLOCK_402_MACRO  (0x00106480)    /*   64B: 0x00106480 - 0x001064BF */
#define FLASH_DF_BLOCK_403_MACRO  (0x001064C0)    /*   64B: 0x001064C0 - 0x001064FF */
#define FLASH_DF_BLOCK_404_MACRO  (0x00106500)    /*   64B: 0x00106500 - 0x0010653F */
#define FLASH_DF_BLOCK_405_MACRO  (0x00106540)    /*   64B: 0x00106540 - 0x0010657F */
#define FLASH_DF_BLOCK_406_MACRO  (0x00106580)    /*   64B: 0x00106580 - 0x001065BF */
#define FLASH_DF_BLOCK_407_MACRO  (0x001065C0)    /*   64B: 0x001065C0 - 0x001065FF */
#define FLASH_DF_BLOCK_408_MACRO  (0x00106600)    /*   64B: 0x00106600 - 0x0010663F */
#define FLASH_DF_BLOCK_409_MACRO  (0x00106640)    /*   64B: 0x00106640 - 0x0010667F */
#define FLASH_DF_BLOCK_410_MACRO  (0x00106680)    /*   64B: 0x00106680 - 0x001066BF */
#define FLASH_DF_BLOCK_411_MACRO  (0x001066C0)    /*   64B: 0x001066C0 - 0x001066FF */
#define FLASH_DF_BLOCK_412_MACRO  (0x00106700)    /*   64B: 0x00106700 - 0x0010673F */
#define FLASH_DF_BLOCK_413_MACRO  (0x00106740)    /*   64B: 0x00106740 - 0x0010677F */
#define FLASH_DF_BLOCK_414_MACRO  (0x00106780)    /*   64B: 0x00106780 - 0x001067BF */
#define FLASH_DF_BLOCK_415_MACRO  (0x001067C0)    /*   64B: 0x001067C0 - 0x001067FF */
#define FLASH_DF_BLOCK_416_MACRO  (0x00106800)    /*   64B: 0x00106800 - 0x0010683F */
#define FLASH_DF_BLOCK_417_MACRO  (0x00106840)    /*   64B: 0x00106840 - 0x0010687F */
#define FLASH_DF_BLOCK_418_MACRO  (0x00106880)    /*   64B: 0x00106880 - 0x001068BF */
#define FLASH_DF_BLOCK_419_MACRO  (0x001068C0)    /*   64B: 0x001068C0 - 0x001068FF */
#define FLASH_DF_BLOCK_420_MACRO  (0x00106900)    /*   64B: 0x00106900 - 0x0010693F */
#define FLASH_DF_BLOCK_421_MACRO  (0x00106940)    /*   64B: 0x00106940 - 0x0010697F */
#define FLASH_DF_BLOCK_422_MACRO  (0x00106980)    /*   64B: 0x00106980 - 0x001069BF */
#define FLASH_DF_BLOCK_423_MACRO  (0x001069C0)    /*   64B: 0x001069C0 - 0x001069FF */
#define FLASH_DF_BLOCK_424_MACRO  (0x00106A00)    /*   64B: 0x00106A00 - 0x00106A3F */
#define FLASH_DF_BLOCK_425_MACRO  (0x00106A40)    /*   64B: 0x00106A40 - 0x00106A7F */
#define FLASH_DF_BLOCK_426_MACRO  (0x00106A80)    /*   64B: 0x00106A80 - 0x00106ABF */
#define FLASH_DF_BLOCK_427_MACRO  (0x00106AC0)    /*   64B: 0x00106AC0 - 0x00106AFF */
#define FLASH_DF_BLOCK_428_MACRO  (0x00106B00)    /*   64B: 0x00106B00 - 0x00106B3F */
#define FLASH_DF_BLOCK_429_MACRO  (0x00106B40)    /*   64B: 0x00106B40 - 0x00106B7F */
#define FLASH_DF_BLOCK_430_MACRO  (0x00106B80)    /*   64B: 0x00106B80 - 0x00106BBF */
#define FLASH_DF_BLOCK_431_MACRO  (0x00106BC0)    /*   64B: 0x00106BC0 - 0x00106BFF */
#define FLASH_DF_BLOCK_432_MACRO  (0x00106C00)    /*   64B: 0x00106C00 - 0x00106C3F */
#define FLASH_DF_BLOCK_433_MACRO  (0x00106C40)    /*   64B: 0x00106C40 - 0x00106C7F */
#define FLASH_DF_BLOCK_434_MACRO  (0x00106C80)    /*   64B: 0x00106C80 - 0x00106CBF */
#define FLASH_DF_BLOCK_435_MACRO  (0x00106CC0)    /*   64B: 0x00106CC0 - 0x00106CFF */
#define FLASH_DF_BLOCK_436_MACRO  (0x00106D00)    /*   64B: 0x00106D00 - 0x00106D3F */
#define FLASH_DF_BLOCK_437_MACRO  (0x00106D40)    /*   64B: 0x00106D40 - 0x00106D7F */
#define FLASH_DF_BLOCK_438_MACRO  (0x00106D80)    /*   64B: 0x00106D80 - 0x00106DBF */
#define FLASH_DF_BLOCK_439_MACRO  (0x00106DC0)    /*   64B: 0x00106DC0 - 0x00106DFF */
#define FLASH_DF_BLOCK_440_MACRO  (0x00106E00)    /*   64B: 0x00106E00 - 0x00106E3F */
#define FLASH_DF_BLOCK_441_MACRO  (0x00106E40)    /*   64B: 0x00106E40 - 0x00106E7F */
#define FLASH_DF_BLOCK_442_MACRO  (0x00106E80)    /*   64B: 0x00106E80 - 0x00106EBF */
#define FLASH_DF_BLOCK_443_MACRO  (0x00106EC0)    /*   64B: 0x00106EC0 - 0x00106EFF */
#define FLASH_DF_BLOCK_444_MACRO  (0x00106F00)    /*   64B: 0x00106F00 - 0x00106F3F */
#define FLASH_DF_BLOCK_445_MACRO  (0x00106F40)    /*   64B: 0x00106F40 - 0x00106F7F */
#define FLASH_DF_BLOCK_446_MACRO  (0x00106F80)    /*   64B: 0x00106F80 - 0x00106FBF */
#define FLASH_DF_BLOCK_447_MACRO  (0x00106FC0)    /*   64B: 0x00106FC0 - 0x00106FFF */
#define FLASH_DF_BLOCK_448_MACRO  (0x00107000)    /*   64B: 0x00107000 - 0x0010703F */
#define FLASH_DF_BLOCK_449_MACRO  (0x00107040)    /*   64B: 0x00107040 - 0x0010707F */
#define FLASH_DF_BLOCK_450_MACRO  (0x00107080)    /*   64B: 0x00107080 - 0x001070BF */
#define FLASH_DF_BLOCK_451_MACRO  (0x001070C0)    /*   64B: 0x001070C0 - 0x001070FF */
#define FLASH_DF_BLOCK_452_MACRO  (0x00107100)    /*   64B: 0x00107100 - 0x0010713F */
#define FLASH_DF_BLOCK_453_MACRO  (0x00107140)    /*   64B: 0x00107140 - 0x0010717F */
#define FLASH_DF_BLOCK_454_MACRO  (0x00107180)    /*   64B: 0x00107180 - 0x001071BF */
#define FLASH_DF_BLOCK_455_MACRO  (0x001071C0)    /*   64B: 0x001071C0 - 0x001071FF */
#define FLASH_DF_BLOCK_456_MACRO  (0x00107200)    /*   64B: 0x00107200 - 0x0010723F */
#define FLASH_DF_BLOCK_457_MACRO  (0x00107240)    /*   64B: 0x00107240 - 0x0010727F */
#define FLASH_DF_BLOCK_458_MACRO  (0x00107280)    /*   64B: 0x00107280 - 0x001072BF */
#define FLASH_DF_BLOCK_459_MACRO  (0x001072C0)    /*   64B: 0x001072C0 - 0x001072FF */
#define FLASH_DF_BLOCK_460_MACRO  (0x00107300)    /*   64B: 0x00107300 - 0x0010733F */
#define FLASH_DF_BLOCK_461_MACRO  (0x00107340)    /*   64B: 0x00107340 - 0x0010737F */
#define FLASH_DF_BLOCK_462_MACRO  (0x00107380)    /*   64B: 0x00107380 - 0x001073BF */
#define FLASH_DF_BLOCK_463_MACRO  (0x001073C0)    /*   64B: 0x001073C0 - 0x001073FF */
#define FLASH_DF_BLOCK_464_MACRO  (0x00107400)    /*   64B: 0x00107400 - 0x0010743F */
#define FLASH_DF_BLOCK_465_MACRO  (0x00107440)    /*   64B: 0x00107440 - 0x0010747F */
#define FLASH_DF_BLOCK_466_MACRO  (0x00107480)    /*   64B: 0x00107480 - 0x001074BF */
#define FLASH_DF_BLOCK_467_MACRO  (0x001074C0)    /*   64B: 0x001074C0 - 0x001074FF */
#define FLASH_DF_BLOCK_468_MACRO  (0x00107500)    /*   64B: 0x00107500 - 0x0010753F */
#define FLASH_DF_BLOCK_469_MACRO  (0x00107540)    /*   64B: 0x00107540 - 0x0010757F */
#define FLASH_DF_BLOCK_470_MACRO  (0x00107580)    /*   64B: 0x00107580 - 0x001075BF */
#define FLASH_DF_BLOCK_471_MACRO  (0x001075C0)    /*   64B: 0x001075C0 - 0x001075FF */
#define FLASH_DF_BLOCK_472_MACRO  (0x00107600)    /*   64B: 0x00107600 - 0x0010763F */
#define FLASH_DF_BLOCK_473_MACRO  (0x00107640)    /*   64B: 0x00107640 - 0x0010767F */
#define FLASH_DF_BLOCK_474_MACRO  (0x00107680)    /*   64B: 0x00107680 - 0x001076BF */
#define FLASH_DF_BLOCK_475_MACRO  (0x001076C0)    /*   64B: 0x001076C0 - 0x001076FF */
#define FLASH_DF_BLOCK_476_MACRO  (0x00107700)    /*   64B: 0x00107700 - 0x0010773F */
#define FLASH_DF_BLOCK_477_MACRO  (0x00107740)    /*   64B: 0x00107740 - 0x0010777F */
#define FLASH_DF_BLOCK_478_MACRO  (0x00107780)    /*   64B: 0x00107780 - 0x001077BF */
#define FLASH_DF_BLOCK_479_MACRO  (0x001077C0)    /*   64B: 0x001077C0 - 0x001077FF */
#define FLASH_DF_BLOCK_480_MACRO  (0x00107800)    /*   64B: 0x00107800 - 0x0010783F */
#define FLASH_DF_BLOCK_481_MACRO  (0x00107840)    /*   64B: 0x00107840 - 0x0010787F */
#define FLASH_DF_BLOCK_482_MACRO  (0x00107880)    /*   64B: 0x00107880 - 0x001078BF */
#define FLASH_DF_BLOCK_483_MACRO  (0x001078C0)    /*   64B: 0x001078C0 - 0x001078FF */
#define FLASH_DF_BLOCK_484_MACRO  (0x00107900)    /*   64B: 0x00107900 - 0x0010793F */
#define FLASH_DF_BLOCK_485_MACRO  (0x00107940)    /*   64B: 0x00107940 - 0x0010797F */
#define FLASH_DF_BLOCK_486_MACRO  (0x00107980)    /*   64B: 0x00107980 - 0x001079BF */
#define FLASH_DF_BLOCK_487_MACRO  (0x001079C0)    /*   64B: 0x001079C0 - 0x001079FF */
#define FLASH_DF_BLOCK_488_MACRO  (0x00107A00)    /*   64B: 0x00107A00 - 0x00107A3F */
#define FLASH_DF_BLOCK_489_MACRO  (0x00107A40)    /*   64B: 0x00107A40 - 0x00107A7F */
#define FLASH_DF_BLOCK_490_MACRO  (0x00107A80)    /*   64B: 0x00107A80 - 0x00107ABF */
#define FLASH_DF_BLOCK_491_MACRO  (0x00107AC0)    /*   64B: 0x00107AC0 - 0x00107AFF */
#define FLASH_DF_BLOCK_492_MACRO  (0x00107B00)    /*   64B: 0x00107B00 - 0x00107B3F */
#define FLASH_DF_BLOCK_493_MACRO  (0x00107B40)    /*   64B: 0x00107B40 - 0x00107B7F */
#define FLASH_DF_BLOCK_494_MACRO  (0x00107B80)    /*   64B: 0x00107B80 - 0x00107BBF */
#define FLASH_DF_BLOCK_495_MACRO  (0x00107BC0)    /*   64B: 0x00107BC0 - 0x00107BFF */
#define FLASH_DF_BLOCK_496_MACRO  (0x00107C00)    /*   64B: 0x00107C00 - 0x00107C3F */
#define FLASH_DF_BLOCK_497_MACRO  (0x00107C40)    /*   64B: 0x00107C40 - 0x00107C7F */
#define FLASH_DF_BLOCK_498_MACRO  (0x00107C80)    /*   64B: 0x00107C80 - 0x00107CBF */
#define FLASH_DF_BLOCK_499_MACRO  (0x00107CC0)    /*   64B: 0x00107CC0 - 0x00107CFF */
#define FLASH_DF_BLOCK_500_MACRO  (0x00107D00)    /*   64B: 0x00107D00 - 0x00107D3F */
#define FLASH_DF_BLOCK_501_MACRO  (0x00107D40)    /*   64B: 0x00107D40 - 0x00107D7F */
#define FLASH_DF_BLOCK_502_MACRO  (0x00107D80)    /*   64B: 0x00107D80 - 0x00107DBF */
#define FLASH_DF_BLOCK_503_MACRO  (0x00107DC0)    /*   64B: 0x00107DC0 - 0x00107DFF */
#define FLASH_DF_BLOCK_504_MACRO  (0x00107E00)    /*   64B: 0x00107E00 - 0x00107E3F */
#define FLASH_DF_BLOCK_505_MACRO  (0x00107E40)    /*   64B: 0x00107E40 - 0x00107E7F */
#define FLASH_DF_BLOCK_506_MACRO  (0x00107E80)    /*   64B: 0x00107E80 - 0x00107EBF */
#define FLASH_DF_BLOCK_507_MACRO  (0x00107EC0)    /*   64B: 0x00107EC0 - 0x00107EFF */
#define FLASH_DF_BLOCK_508_MACRO  (0x00107F00)    /*   64B: 0x00107F00 - 0x00107F3F */
#define FLASH_DF_BLOCK_509_MACRO  (0x00107F40)    /*   64B: 0x00107F40 - 0x00107F7F */
#define FLASH_DF_BLOCK_510_MACRO  (0x00107F80)    /*   64B: 0x00107F80 - 0x00107FBF */
#define FLASH_DF_BLOCK_511_MACRO  (0x00107FC0)    /*   64B: 0x00107FC0 - 0x00107FFF */

#endif /* LITTLEFS_COMMON_RM_LITTLEFS_DF_TARGETS_RX65N_RM_LITTLEFS_DF_RX65N_H_ */
